{
    "Name": "Demilich",
    "Creature Type": "Tiny Undead",
    "Max HP": 80,
    "Movement Speeds": {
        "Number": 2,
        "Type 1": "Walking",
        "Speed 1": 0,
        "Type 2": "Flying",
        "Speed 2": 30
    },
    "Challenge Rating": "18",
    "EXP": 20000,
    "Skills": {
        "Number": 1,
        "Skill 1": "N/A"
    },
    "Senses": {
        "Number": 2,
        "Sense 1": "Truesight",
        "Sense 2": "Medium Passive Perception"
    },
    "Languages": {
        "Number": 1,
        "Language 1": "None"
    },
    "Equipment Actions": {
        "Number": 1,
        "Action 1": "None"
    },
    "Other Actions": {
        "Number": 2,
        "Action 1": "Howl, The Demilich emits a bloodcurdling how, each creature that can hear the howl must succeed on a Constituion Saving Throw or drop to 0 hit points.  On a successful save, the creature is frightened instead",
        "Action 2": "Life Drain, The Demilich can target 3 creatures, each creature makes a Constituion Saving Throw, taking an Average Damage of 21 Necrotic.  The Demilich heals for the total amount of damage dealt to all targets"
    },
    "AC": 20,
    "Stats": {
        "Strength": 1,
        "Dexterity": 20,
        "Constitution": 10,
        "Intelligence": 20,
        "Wisdom": 17,
        "Charisma": 20
    },
    "Abilities": {
        "Number": 3,
        "Ability 1": "Avoidance, Of the Demilich is subjected to an effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails",
        "Ability 2": "Legendary Resistance, If the Demilich fails a saving throw, it can choose to succeed instead",
        "Ability 3": "Turn Immunity, The Demilich is immune to effects that turn undead"
    },
    "Damage Vulnerabilities": {
        "Number": 1,
        "Damage 1": "N/A"
    },
    "Damage Resistances": {
        "Number": 1,
        "Damage 1": "Bludgeoning, Piercing, and Slashing from Magic Weapons"
    },
    "Damage Immunities": {
        "Number": 4,
        "Damage 1": "Necrotic",
        "Damage 2": "Poison",
        "Damage 3": "Psychic",
        "Damage 4": "Bludgeoning, Piercing, and Slashing from nonmagical attacks"
    },
    "Condition Immunities": {
        "Number": 9,
        "Condition 1": "Charmed",
        "Condition 2": "Deafened",
        "Condition 3": "Exhaustion",
        "Condition 4": "Frightened",
        "Condition 5": "Paralyzed",
        "Condition 6": "Petrified",
        "Condition 7": "Poisoned",
        "Condition 8": "Prone",
        "Condition 9": "Stunned"
    },
    "Legendary Actions": {
        "Number": 4,
        "Action 1": "Flight, The Demilich flies up to half its flying speed",
        "Action 2": "Cloud of Dust, The Demilich magically swirls its dusty remains, attempting to blind nearby creatures",
        "Action 3": "Energy Drain, The Demilich attempts to drain the Hit Point Maximum of all creatures near it",
        "Action 4": "Vile Curse, The Demilich targets one creature and attempts to magically curse them.  This curse forces disadvantage on all Attack Rolls and Saving Throws.  The afflicted creature can make a Saving Throw at the end of its turn to try and break the curse"
    },
    "Lair Actions": {
        "Number": 3,
        "Action 1": "The Demilich causes the floor of the tomb to tremble violently, attempting to knock creatures prone",
        "Action 2": "The Demilich targets one creature, surrounding them with an antimagic field that moves with the target",
        "Action 3": "The Demilich targets any number of creatures it can see, none of the targets can regain hit points"
    }    
}